trade_exp/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
  </predefined>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаАктивна</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаАктивацииБонуснойПрограммы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПИН_Код</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2d8cff6-485d-4179-8e9c-c0e74d4f7704">
    <name>АктивнаяФаза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ed10a1b-4743-4b2e-b332-43a49c33d53a">
    <name>ОбъемСтроительства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d937f9b-c6c0-400a-a976-e17d07dc2cf4">
    <name>ДатаНачалаАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ab7b5f85-1360-48d2-9266-6d9b809fa216">
    <name>НормативПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПодтвержденияНомераТелефона</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНомераТелефона</name>
    <type>
      <types>EnumRef.СостояниеНомераТелефона</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойОборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="63694e17-0adb-4a8a-afea-e4e7735edfc1">
    <name>СоглашениеДляРассылок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf121ead-3982-46d0-bcce-a08413595a1f">
    <name>Парсинг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="59343292-e18c-4609-a039-11cc8d8cd93a">
    <name>ВидыНоменклатурыАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="eeb4daa7-609a-4968-8745-1b6125400c0b">
      <name>ВидНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f09dd5d-7de9-4a21-a839-9674c6120b36">
      <name>Коэффициент</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e8a1213f-80cf-4cf1-866d-59ee4fa4ffbe">
      <name>ЭтапСтроительства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0daacbf9-aa02-4485-a535-d2d28b00523c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8667b665-ede0-456e-ad08-51f4cf43503a">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6203050a-d3b4-4e82-89f7-5ad54cf4906b">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3b79728c-4ce5-4330-b398-b32f0bb3e6d5">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9e943c2-8fad-47c5-b878-66f2576cc609">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2ac6cdc9-f345-456a-9bd8-2e5ae5af6f56">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6245a898-0f24-4b85-b2d7-89831867e9d9">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9d10a2ad-841d-4931-902b-83db2a08aaaa">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2acd53d1-e5ab-4fe9-8341-24b714c87f11">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e30e3544-d00d-4269-ac29-88451a763262">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="675d6c69-31a6-49c2-a9b2-cc82f578bbeb">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce03862f-daeb-4d43-a69d-c989cd1f6089">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72399ba5-bcbe-40be-b76e-ff36467bc65d">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="df571c83-e6f9-459f-abbc-6e6053e6eb48">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/ЗакреплениеКлиентов/ЗакреплениеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0e77b5a2-ffa9-469f-8693-cf5f83743f8f">
  <name>ЗакреплениеКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="016d8cf2-2bd8-4c62-a595-6427befaca23">
    <name>ЗакрепленныйПользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a852551b-5f10-4583-88ca-64a746a35055">
    <name>ПодразделениеПользователя</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c39f0659-84f9-49e5-9004-f80bdfc49e85">
    <name>ОтделПользователя</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="ad6cdbc0-bc6b-4b09-a441-35a987ed5cd6">
    <name>НаправлениеПользователя</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="94edd240-af27-4031-9351-2e7b3e87c55b">
    <name>АвторИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="82d795e6-9d78-4b69-9b3a-e934f4b7a424">
    <name>ДатаИВремяЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="00b4fd94-63a4-4608-99b5-26b490cf64f6">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4b1217dd-66ee-48e0-89e6-d61338c76c40">
    <name>ВидМенеджераКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДополнительныеСведения/ДополнительныеСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3ad5d8a7-3071-46aa-aebf-306bdb67983b">
  <name>ДополнительныеСведения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ab7ef662-71c1-4d51-9f0f-ea8c5ea3df8a">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="cb954476-c551-4a06-9bcd-18d67ba47dc8">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="79201015-bfae-463e-81f1-0ae2d3066f3f">
    <name>Свойство</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/КомпанияЧастноеЛицо/КомпанияЧастноеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КомпанияЧастноеЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="640f3f70-7e8d-48fb-8487-fda65cb57f60">
    <name>ЧастноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af9cb34d-d5ea-4de1-a7d6-999e6bd67541">
    <name>Компания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВидМенеджераКлиента/ВидМенеджераКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="64183561-4ec6-4252-8786-fa31d18674a2">
  <name>ВидМенеджераКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="102dd37f-09e6-42ae-9e51-58371ee0c628">
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9e996aa2-a315-4dd1-85ef-b38ef077c229">
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Партнеры/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура Спр_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Парсинг.Доступность = АльтерраОбщегоНазначения._ЕстьРоль("УстановкаФлажкаПарсингВПартнерах");
	
	// Альтерра Устинов В.А. Начало блока 14.03.2013 15:26:55
	Элементы.ОсновнойМенеджер.Доступность=рольДоступна("ПолныеПрава") или рольДоступна("ОтделАналитики");
	//Светлакова
	Элементы.БонуснаяПрограммаАктивна.ТолькоПросмотр = не (рольДоступна("ПолныеПрава") или рольДоступна("НазначениеСтатусовКлиентовВБонуснойПрограмме")) или Объект.БонуснаяПрограммаАктивна = 1 ;
	Элементы.ПИН_Код.Видимость = рольДоступна("ПолныеПрава"); //или рольДоступна("НазначениеСтатусовКлиентовВБонуснойПрограмме")) ;
	
	//Этапы строительства+
	//добавление элемента на форму
	ПолеЛюбимыйМагазин = Элементы.Добавить("ЛюбимыйМагазин", Тип("ПолеФормы"), Элементы.ГруппаМенеджерДоступ);
	ПолеЛюбимыйМагазин.ПутьКДанным = "Объект.ЛюбимыйМагазин";
	ПолеЛюбимыйМагазин.Вид = ВидПоляФормы.ПолеВвода;
	ПолеЛюбимыйМагазин.Заголовок = "Любимый магазин";
	
	ПолеСпособОтгрузки = Элементы.Добавить("СпособОтгрузки", Тип("ПолеФормы"), Элементы.ГруппаМенеджерДоступ);
	ПолеСпособОтгрузки.ПутьКДанным = "Объект.СпособОтгрузки";
	ПолеСпособОтгрузки.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСпособОтгрузки.Заголовок = "Способ отгрузки";
	
	//Элементы.МАП.Доступность = рольДоступна("ПолныеПрава") или рольДоступна("ИзменениеОсновногоМенеджераПартнера");
	Элементы._ГруппаЭтапСтроительства.Видимость = АльтерраОбщегоНазначения.ЭтоЧастноеЛицо(Объект.Ссылка);
	ОбновитьДоступностьЭлементовСтроительства();
	РасчетПотенциала();
	//+Этапы строительства
	
	//Видимость для «Группа партнеров» «Частные лица» и "Сотрудники"
	Если АльтерраОбщегоНазначения.ЭтоЧастноеЛицо(Объект.Ссылка) Или АльтерраОбщегоНазначения.ЭтоСотрудник(Объект.Ссылка)Тогда
		Элементы.ГруппаСостояниеНомераТелефона.Видимость = Истина;
	КонецЕсли; 
	
	//Видимость для Годового оборота (для последующей доработки)
	Элементы.ГруппаГодовойОборот.Видимость = Ложь;
	//Элементы.ГруппаГодовойОборот.Видимость = ?(АльтерраОбщегоНазначения.ЭтоЧастноеЛицо(Объект.Ссылка) Или Не ЗначениеЗаполнено(Объект.ГодовойОборот) , Ложь, Истина);
	
	Элементы.НормативПоУмолчанию.Видимость = Объект.Поставщик;
	
	Если Параметры.Ключ.Пустая() Тогда
    	Объект.БонуснаяПрограммаАктивна = Ложь;
	КонецЕсли;
	
   ОбновитьТелефонНаСайте = Ложь;//
	
КонецПроцедуры

&НаКлиенте
Процедура Спр_БонуснаяПрограммаАктивнаПриИзмененииПосле(Элемент)
		Если  Объект.БонуснаяПрограммаАктивна = 1 и  Объект.ДатаАктивацииБонуснойПрограммы = '00010101000000' Тогда
	  	   Объект.ДатаАктивацииБонуснойПрограммы = ТекущаяДата();
		  иначеЕсли  Объект.БонуснаяПрограммаАктивна = 0 Тогда  
		   Объект.ДатаАктивацииБонуснойПрограммы = '00010101000000'; 
	    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Док_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ИсточникПервичногоИнтереса) Тогда
		БонусыАльтерра.УстановитьСтатусПоМаркетинговомуМероприятию(Объект.Ссылка, ИсточникПервичногоИнтереса);
	КонецЕсли;
	
	ОбновитьТелефонНаСайте();

	ЗаписатьЗакреплениеМенеджерМАП(ПараметрыЗаписи);
		
КонецПроцедуры

&НаКлиенте
Процедура Док_ПоставщикПриИзмененииПосле(Элемент)
	Элементы.НормативПоУмолчанию.Видимость = Объект.Поставщик;
КонецПроцедуры

#Область ЭтапыСтроительства
&НаСервере                     
Процедура ОбновитьДоступностьЭлементовСтроительства()
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Элементы._ГруппаАктивнаяФаза.Доступность = (Параметры.Ключ.Пустая() ИЛИ ТекущийПользователь=Объект.МАП ИЛИ ПользовательИмеетПраваУТСК(ТекущийПользователь) ИЛИ Объект.АктивнаяФаза=Справочники.ЭтапыСтроительства.ПустаяСсылка()); 
	Элементы.АктивнаяФаза.ТолькоПросмотр = НЕ (Параметры.Ключ.Пустая() ИЛИ ТекущийПользователь=Объект.МАП ИЛИ ПользовательИмеетПраваУТСК(ТекущийПользователь) ИЛИ Объект.АктивнаяФаза=Справочники.ЭтапыСтроительства.ПустаяСсылка()); 
	Элементы.ДатаНачалаАктивнойФазы.ТолькоПросмотр = Элементы.АктивнаяФаза.ТолькоПросмотр; 
	//Доступность назначения МАПа
	ДоступностьМАПа = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ОтделАналитики");
	//Если Не Объект.Ссылка.Пустая() И Модифицированность=Ложь И Объект.МАП <> ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") И ДоступностьМАПа Тогда 
	//	ДоступностьМАПа = (ТекущийПользователь=Объект.МАП);
	//КонецЕсли;
	Элементы.МАП.Доступность =  ДоступностьМАПа;
КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	СписокН = ЭтаФорма.Элементы.ВидыНоменклатурыАктивнойФазы;
	СписокН.ОтборСтрок = Новый ФиксированнаяСтруктура("ЭтапСтроительства", Объект.АктивнаяФаза);  
КонецПроцедуры

&НаКлиенте
Процедура Док_ДобавитьНовуюСтрокуПосле(Команда)
	Если ЗначениеЗаполнено(Объект.АктивнаяФаза) Тогда
		Оповещение = Новый ОписаниеОповещения("ОткрытьПараметрыЗавершение",ЭтотОбъект);
		ПараметрыФормы = Новый Структура("АктивнаяФаза", Объект.АктивнаяФаза);
		ОткрытьФорму("Справочник.Партнеры.Форма.Док_ФормаВидыНоменклатуры", ПараметрыФормы,ЭтаФорма,,,,Оповещение,);
	Иначе
		Сообщить("Активная фаза не заполнена!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_АктивнаяФазаПриИзмененииПосле(Элемент)
	СписокН = ЭтаФорма.Элементы.ВидыНоменклатурыАктивнойФазы;
	СписокН.ОтборСтрок = Новый ФиксированнаяСтруктура("ЭтапСтроительства", Объект.АктивнаяФаза); 
	Объект.ДатаНачалаАктивнойФазы = '00010101';
	Объект.ВидыНоменклатурыАктивнойФазы.Очистить();
	Объект.ОбъемСтроительства = 0;
	Потенциал = 0;
	РасчетПотенциала();
КонецПроцедуры

&НаКлиенте
Процедура Док_МАППриИзмененииПосле(Элемент)
	ОбновитьДоступностьЭлементовСтроительства();
КонецПроцедуры

&НаКлиенте
Процедура Док_ОбъемСтроительстваПриИзмененииПосле(Элемент)
	РасчетПотенциала();
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьПараметрыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	ОткрытьПараметрыЗавершениеСервер(Результат);
КонецПроцедуры 

&НаСервере
Функция ПользовательИмеетПраваУТСК(Пользователь)
	ЕстьПрава = Ложь;
	Если  Объект.АктивнаяФаза <> Справочники.ЭтапыСтроительства.ПустаяСсылка() Тогда
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		АктуальныйУТСК = ТекОбъект.ПолучитьАктуальногоУТСК(Объект.Ссылка);
		ЕстьПрава = АктуальныйУТСК=Пользователь;
	Иначе
		ГруппаПользователейРТСК = Справочники.ГруппыПользователей.НайтиПоНаименованию("Руководитель ТСК");
		МассивУТСК = ГруппаПользователейРТСК.Состав.Выгрузить().ВыгрузитьКолонку("Пользователь");
		ЕстьПрава = МассивУТСК.Найти(Пользователь)<>Неопределено;
	КонецЕсли;
	Возврат ЕстьПрава; 
КонецФункции // ПолучитьУТСК()

&НаСервере 
Процедура РасчетПотенциала()
	Если ЗначениеЗаполнено(Объект.АктивнаяФаза) Тогда
		Потенциал = Объект.АктивнаяФаза.СтроительныйОбъем*Объект.ОбъемСтроительства*3600;
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ОткрытьПараметрыЗавершениеСервер(Результат) Экспорт 
	Если ТипЗнч(Результат) = Тип("ДанныеФормыКоллекция") тогда 
		Для каждого Строка из Результат Цикл
			Для каждого СтрокаТЗ из Объект.ВидыНоменклатурыАктивнойФазы Цикл
				Если СтрокаТЗ.ВидНоменклатуры = Строка.ВидНоменклатуры Тогда
					Объект.ВидыНоменклатурыАктивнойФазы.Удалить(СтрокаТЗ);
				КонецЕсли;
			КонецЦикла;
			НоваяСтрока = Объект.ВидыНоменклатурыАктивнойФазы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		КонецЦикла;
	конецесли;
КонецПроцедуры 

#Область КалькуляторОбъемаСтроительства
&НаКлиенте
Процедура Док_РассчитатьОбъемРаботВместо(Команда)
	Этажность = 1;
	Элементы._ГруппаРазмерыОбъектаСтроительства.Видимость =  Истина;
КонецПроцедуры

&НаКлиенте
Процедура Док_ПлощадьПоФундаментуПриИзмененииВместо(Элемент)
	ПересчитатьОбъемСтроительства();
КонецПроцедуры

&НаКлиенте
Процедура Док_ВысотаЭтажаПриИзмененииВместо(Элемент)
	ПересчитатьОбъемСтроительства();
КонецПроцедуры

&НаКлиенте
Процедура Док_ЭтажностьПриИзмененииВместо(Элемент)
	ПересчитатьОбъемСтроительства();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбъемСтроительства()
	Объект.ОбъемСтроительства = ПлощадьПоФундаменту*ВысотаЭтажа*Этажность;
	РасчетПотенциала();
КонецПроцедуры // ПересчитатьОбъемСтроительства()

&НаКлиенте
Процедура Док_ЗакрытьКалькуляторВместо(Команда)
	Элементы._ГруппаРазмерыОбъектаСтроительства.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Док_СостояниеНомераТелефонаНажатиеПосле(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	Если Объект.СостояниеНомераТелефона = ПредопределенноеЗначение("Перечисление.СостояниеНомераТелефона.Уточнить")
		Или Объект.СостояниеНомераТелефона = ПредопределенноеЗначение("Перечисление.СостояниеНомераТелефона.Подтвердить") Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьЭлементы", ЭтотОбъект);

			ПараметрыФормы = Новый Структура("ТолькоОтправкаКода, НовыйПартнер, Владелец, ИзменениеТелефона, Действие", 
				Истина, Ложь, Объект.Ссылка, Истина, "1c_verify_phone");
			ОткрытьФорму("Справочник.БонусныеПрограммыЛояльности.Форма.Спр_СМСИдентификация", ПараметрыФормы, Неопределено,,,,ОписаниеОповещения);		
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте 
&После("Подключаемый_КонтактнаяИнформацияНачалоВыбора")
Процедура Док_Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Попытка
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") И СтрНайти(Элемент.Имя, "КонтактнаяИнформация") = 1 
			И Элемент.ТекстРедактирования = ПолучитьСохраненныйНомерТелефона() Тогда
				ИзменениеНомераТелефона = Истина;
			КонецЕсли
	Исключение
	КонецПопытки;
	
КонецПроцедуры 

&НаКлиенте   
&После("Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации")
Процедура Док_Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
	
	Если ИзменениеНомераТелефона Тогда
		Объект.СостояниеНомераТелефона = ПредопределенноеЗначение("Перечисление.СостояниеНомераТелефона.Подтвердить");
		ИзменениеНомераТелефона = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСохраненныйНомерТелефона()
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Ссылка, Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
КонецФункции

&НаКлиенте
Процедура ОбновитьЭлементы(Результат, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Не Параметры.ЗначениеКопирования.Пустая() Тогда
		Отказ = Истина;
		Сообщить("Создание партнера копированием запрещено!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_СоглашениеДляРассылокНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	
	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = Объект.Ссылка;
	ПараметрыВыбораСоглашения.Документ                    = Объект.СоглашениеДляРассылок;
	ПараметрыВыбораСоглашения.ДатаДокумента               = ТекущаяДата();
	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
	
	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПарсингПриИзмененииПосле(Элемент)  
	
	Если Объект.Парсинг Тогда
		Если Объект.Клиент Тогда
			Объект.Парсинг = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отметки 'Клиент' и 'Парсинг' не могут быть выбраны одновремено");
		ИначеЕсли Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо") Тогда  
			Объект.Парсинг = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для парсинга необходимо выбрать 'Компания', а не 'Частное лицо'!");
		ИначеЕсли Не ДопМодульКлиентСервер.ЕстьПарсинг(Объект.Наименование) Тогда
			Объект.Парсинг = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рабочее наименование должно содержать слово '(Парсинг)'!");
		ИначеЕсли Не ДопМодульКлиентСервер.ЕстьПарсинг(Объект.НаименованиеПолное) Тогда
			Объект.Парсинг = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Публичное наименование должно содержать слово '(Парсинг)'!");
		КонецЕсли; 
	Иначе
		Если ДопМодульКлиентСервер.ЕстьПарсинг(Объект.НаименованиеПолное) ИЛИ
			ДопМодульКлиентСервер.ЕстьПарсинг(Объект.НаименованиеПолное) Тогда 
			
			Объект.Парсинг = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наименование содержит слово '(Парсинг)', флажок нельзя убрать!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_КлиентПриИзмененииПосле(Элемент)
	
	Если Объект.Парсинг И Объект.Клиент Тогда
		Объект.Клиент = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отметки 'Клиент' и 'Парсинг' не могут быть выбраны одновремено");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	Если Объект.Парсинг Тогда
		Если Объект.Клиент Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отметки 'Клиент' и 'Парсинг' не могут быть выбраны одновремено");
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Публичное наименование' должно быть заполнено!");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Рабочее наименование' должно быть заполнено!");
		КонецЕсли;               
		
		Если Не ДопМодульКлиентСервер.ЕстьПарсинг(Объект.НаименованиеПолное) ИЛИ 
			Не ДопМодульКлиентСервер.ЕстьПарсинг(Объект.Наименование) Тогда  
			
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Публичное и рабочее наименования должны содержать слово '(парсинг)'!");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.БизнесРегион) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("'Бизнес-регион' должен быть указан!");
		КонецЕсли;
	КонецЕсли;            	
КонецПроцедуры

&НаСервере
Процедура Док_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ 
		|	ОсновнойМенеджер, МАП
		|ИЗ
		|	Справочник.Партнеры
		|ГДЕ 
		|	Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ТекущийОбъект.ОсновнойМенеджер <> Выборка.ОсновнойМенеджер Тогда
			ПараметрыЗаписи.Вставить("ИзменениеОсновнойМенеджер", Истина);
		КонецЕсли;
		Если ТекущийОбъект.МАП <> Выборка.МАП Тогда
			ПараметрыЗаписи.Вставить("ИзменениеМАП", Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьТелефонНаСайте()
	Если ОбновитьТелефонНаСайте Тогда
	Если АльтерраОбщегоНазначения.ЭтоРабочаяБаза() Тогда
	   ОтборТелефона = Новый Структура("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПартнера"));
	   Телефоны = Объект.КонтактнаяИнформация.НайтиСтроки(ОтборТелефона);
	   Если Телефоны.Количество() >0 Тогда  
	       Телефон = Телефоны[0].НомерТелефона;
	     Если ЗначениеЗаполнено(Телефон)Тогда
	          УидПартнера = Объект.Ссылка.УникальныйИдентификатор();
	          ssl = Новый ЗащищенноеСоединениеOpenSSL;
		      HTTPСоединение = Новый HTTPСоединение("tg-alterra.ru",,,,,200,ssl); 
              HTTPЗапрос = Новый HTTPЗапрос("api/v1/profile/client.acceptChanges?XML_ID=" + УидПартнера +"&PERSONAL_PHONE=" + Телефон);
			  Попытка
			      Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос); // Отправка запроса методом POST
			      Сообщить("Номер телефона на сайте успешно изменен на " + Телефон);	
			      ОбновитьТелефонНаСайте = Ложь;
			  Исключение 
			      ЗаписьЖурналаРегистрации("Ошибка отправки запроса",УровеньЖурналаРегистрации.Ошибка,,,"Не удалось изменить номер на сайте для клиента" + Объект.Ссылка);
			      Сообщить("Не удалось изменить номер на сайте"); 
			  КонецПопытки;  			  
		  КонецЕсли;
	   КонецЕсли;
	КонецЕсли;                                  
   КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗакреплениеМенеджерМАП(ПараметрыЗаписи);
	
	УстановитьПривилегированныйРежим(Истина);

	Если ПараметрыЗаписи.Свойство("ИзменениеОсновнойМенеджер") Тогда
		ЗаписатьЗакрепление(Объект.ОсновнойМенеджер, Истина);
	КонецЕсли;

	Если ПараметрыЗаписи.Свойство("ИзменениеМАП") Тогда
		ЗаписатьЗакрепление(Объект.МАП, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗакрепление(СсылкаМенеджер, ОсновнойМенджер)
	
	ДатаУстановки = ТекущаяДатаСеанса();
	ВидМенеджера = ?(ОсновнойМенджер, Перечисления.ВидМенеджераКлиента.ОсновнойМенеджер, Перечисления.ВидМенеджераКлиента.МАП);
	ДанныеПользователя = ПолучитьДанныеМенеджера(СсылкаМенеджер);
	
	Попытка
		НаборЗаписей = РегистрыСведений.ЗакреплениеКлиентов.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Период.Установить(ДатаУстановки); 
		НаборЗаписей.Отбор.Клиент.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.ВидМенеджераКлиента.Установить(ВидМенеджера); 
	
		НоваяЗапись = НаборЗаписей.Добавить();      
		НоваяЗапись.Период = ДатаУстановки; 
	   	НоваяЗапись.Клиент = Объект.Ссылка; 
		НоваяЗапись.ВидМенеджераКлиента = ВидМенеджера; 
		НоваяЗапись.ЗакрепленныйПользователь = ДанныеПользователя.Пользователь;
		НоваяЗапись.ПодразделениеПользователя = ДанныеПользователя.ПодразделениеПользователя; 
		НоваяЗапись.ОтделПользователя = ДанныеПользователя.ОтделПользователя; 
		НоваяЗапись.НаправлениеПользователя = ДанныеПользователя.НаправлениеПользователя; 
		НоваяЗапись.АвторИзменения = АльтерраОбщегоНазначения.ТекущийПользователь(); 
		НоваяЗапись.ДатаИВремяЗаписи = ДатаУстановки; 
		НаборЗаписей.Записать();
		
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеМенеджера(Менеджер)
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
		"ВЫБРАТЬ 
		|	ДопСведенияОтдел.Объект КАК Пользователь,  
		|	ДопСведенияОтдел.Значение КАК ОтделПользователя
		|ПОМЕСТИТЬ втОтделыПользователей	
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДопСведенияОтдел 
		|СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДопРеквизитыОтдел
		|	ПО ДопСведенияОтдел.Свойство = ДопРеквизитыОтдел.Ссылка 
		|	И ДопРеквизитыОтдел.Имя = &ИмяОтдела
		|ГДЕ 
		|	ДопСведенияОтдел.Объект ССЫЛКА Справочник.Пользователи      
		|;   
		|
		|//////////////////////////////////////////////////////////////////////////////// 	
		|ВЫБРАТЬ 
		|	ДопСведенияНаправление.Объект КАК Пользователь,  
		|	ДопСведенияНаправление.Значение КАК НаправлениеПользователя
		|ПОМЕСТИТЬ втНаправленияПользователей	
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДопСведенияНаправление 
		|СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДопРеквизитыНаправление
		|	ПО ДопСведенияНаправление.Свойство = ДопРеквизитыНаправление.Ссылка 
		|	И ДопРеквизитыНаправление.Имя = &ИмяНаправления
		|ГДЕ 
		|	ДопСведенияНаправление.Объект ССЫЛКА Справочник.Пользователи      
		|;
		|	     
		|//////////////////////////////////////////////////////////////////////////////// 		     
		|ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь,
		|	Пользователи.Подразделение КАК ПодразделениеПользователя,
		|	втОтделыПользователей.ОтделПользователя,
		|	втНаправленияПользователей.НаправлениеПользователя	
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи  
		|ЛЕВОЕ СОЕДИНЕНИЕ втОтделыПользователей	
		|	ПО Пользователи.Ссылка = втОтделыПользователей.Пользователь
		|ЛЕВОЕ СОЕДИНЕНИЕ втНаправленияПользователей	
		|	ПО Пользователи.Ссылка = втНаправленияПользователей.Пользователь
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь";
		
	Запрос.УстановитьПараметр("ИмяОтдела", "Отделы");       
	Запрос.УстановитьПараметр("ИмяНаправления", "Направление_a6534376afdf4540a6eac88535d3665b");       
	Запрос.УстановитьПараметр("Пользователь", Менеджер);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеМенеджера = Новый Структура;
	ДанныеМенеджера.Вставить("Пользователь", 				ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	ДанныеМенеджера.Вставить("ПодразделениеПользователя", 	ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
	ДанныеМенеджера.Вставить("ОтделПользователя", 			ПредопределенноеЗначение("Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка"));
	ДанныеМенеджера.Вставить("НаправлениеПользователя", 	ПредопределенноеЗначение("Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка"));
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеМенеджера, Выборка);
	КонецЕсли;
		
	Возврат ДанныеМенеджера;
	
КонецФункции	

#КонецОбласти

#КонецОбласти
